/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yback <yback@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/08 20:02:35 by yback             #+#    #+#             */
/*   Updated: 2022/07/11 20:30:42 by yback            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isalnum(int c)
{
	//isalpha 함수와 isdigit 함수를 이용해 알파벳이거나 숫자일 때 1을 출력
	if (!(ft_isalpha(c) || ft_isdigit(c)))
		return (0);
	return (1);
}
