/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memset.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yback <yback@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/07 15:03:04 by yback             #+#    #+#             */
/*   Updated: 2022/07/14 20:29:34 by yback            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

//포인터 b를 len만큼 c로 채우는 함수
void	*ft_memset(void *b, int c, size_t len)
{
	size_t	i;

	i = 0;
	while (i < len)
	{
		//c를 unsigned char로 변환해줘야 한다. (man)
		//char로 변형해서 한 바이트씩 받는 것을 고려해줘야 한다.
		//memset은 바이트 단위로 기능을 수행하기 때문에 이를 주의해야 한다.
		((unsigned char *)b)[i++] = (unsigned char)c;
	}
	return (b);
}
