/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yback <yback@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/08 12:27:26 by yback             #+#    #+#             */
/*   Updated: 2022/07/12 14:25:36 by yback            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

//포인터 s에서 c를 찾아내어 그 주소를 반환하는 함수
char	*ft_strchr(const char *s, int c)
{
	int	i;
	int	size;

	size = 0;
	i = 0;
	while (s[i])
	{
		if (s[i] == (char)c)
			return ((char *)(s + i));
		i++;
	}
	//s의 사이즈를 측정한다.
	while (s[size])
		size++;
	//만약 c가 널이라면 s의 마지막(널)의 주소를 반환한다.
	//s가 널이라면 그냥 널의 주소가 반환될 것이다.
	if (c == 0)
		return ((char *)&s[size]);
	return (0);
}
