/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strdup.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yback <yback@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/08 19:32:51 by yback             #+#    #+#             */
/*   Updated: 2022/07/12 14:38:17 by yback            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

//새로운 포인터를 만들어 메모리 동적 할당 후에 s1을 복사해서 반환하는 함수
char	*ft_strdup(const char *s1)
{
	char	*arr;
	int		i;

	i = 0;
	//s1을 복사해야하므로 사이즈를 측정한다.
	while (s1[i])
		i++;
	arr = (char *)malloc(sizeof(char) * i + 1);
	if (!arr)
		return (0);
	i = 0;
	while (s1[i])
	{
		arr[i] = s1[i];
		i++;
	}
	arr[i] = 0;
	return (arr);
}
